var listDatle = [
    {
        "day": "ច័ន្ទ", "name": "គោរាគៈទេវី", "body": "សៀត​ (ផ្កាអង្គាបុស្ប)", "dio": "កែវមុក្តា ( គជ់ខ្យង )", "foot": "សោយតេលំ ( ប្រេងល្ង ឬ ប្រេងសណ្ដែក )", "web": "( ឆ្វេង-ឈើច្រត់ | ស្តាំ-ព្រះខ័ន )", "background_color": "#FFAA1D",
        "vhc": "វ្យាឃ្រ व्याघ्र ( ខ្លាធំ )"
    },

    {
        "day": "អង្គារ", "name": "រាក្យៈសាទេវី", "body": "សៀត​ (ផ្កាឈូក)", "dio": "កែវមោរ៉ា ( ត្បូងសមុទ្រ ​)", "foot": "សោយលោហិត ( ឈាម )", "web": "( ឆ្វេង-ធ្នូ |ស្តាំ- ត្រីសូល៍ )", "background_color": "#7851A9",
        "vhc": "អស្សតរ अश्व ( សេះ )"
    },

    {
        "day": "ពុធ", "name": "មណ្ឌាទេវី", "body": "សៀត​ (ផ្កាចម្ប៉ា)", "dio": "កែវពិទូរ្យ ( ត្បូងភ្នែកឆ្មា ​)", "foot": "សោយទឹកដោះសប្បិ ( ទឹកដោះគោច្អិន )", "web": "( ឆ្វេង-ឈើច្រត់ | ស្តាំ-ម្ជុល )", "background_color": "#6B8E23",
        "vhc": "គទ្រភៈ गर्दभ ( លា )"
    },

    {
        "day": "ព្រហស្បតិ៍", "name": "កិរិណីទេវី", "body": "សៀត​ ផ្កាមណ្ឌា ( ផ្កាមន្ទារ )", "dio": "មរកត ( ត្បូងពណ៌បៃតង ​)", "foot": "សោយសណ្ដែក ( ល្ង )", "web": "( ឆ្វេង-កាំភ្លើង វជ្រ | ស្តាំ-កង្វេរដំរី )", "background_color": "#008000",
        "vhc": "គជសារ कुञ्चर ( ដំរី )"
    },

    {
        "day": "សុក្រ", "name": "កិមិរាទេវី", "body": "សៀត ផ្កាចង្កុលណី ( ផ្ការំចង់ )", "dio": "ផុស្សរាគ ( ត្បូងពណ៌លឿង ​)", "foot": "សោយចេកណាំវ៉ា", "web": "( ឆ្វេង-ពិណ | ស្តាំ-ព្រះខ័ន )", "background_color": "#1260CC",
        "vhc": "មហឹសា महिष (ក ្របី )"
    },

    {
        "day": "សៅរ៍", "name": "មហោទរាទេវី", "body": "សៀត ផ្កាត្រកៀត ( ផ្កាកំប្លោក )", "dio": "ផុនិលរ័តន៍ ( ត្បូងពណ៌ខៀវ ​)", "foot": "សោយសាច់ទ្រាយ ពពួក ក្ដាន់ ឈ្លូស", "web": "( ឆ្វេង-ត្រីសូល៍ | ស្តាំ-កងចក្រ )", "background_color": "#570861",
        "vhc": "មយូរ៉ា मयूर ( ក្ងោក )"
    },

    {
        "day": "អាទិត្យ", "name": "ទុង្សាទេវី", "body": "សៀត ( ផ្កាទទឹម )", "dio": "បទុមរាគ( ត្បូងទទឹម ​)", "foot": "សោយផ្លែឧទុម្ពរ ( ផ្លែល្វា )", "web": "( ឆ្វេង-ខ្យងស័ង្ខ | ស្តាំ-កងចក្រ )", "background_color": "#FF0000",
        "vhc": "ហ្គារូដា गरुड ( គ្រុឌ )"
    },
];
var imge2 = [
    { "imge": "/img/Kbach_Khmer.png" }
];
function fugetDetals() {
    var txt = ""
    listDatle.forEach((e => {
        txt += `
            <div class="detals-txt">
                <div class="detals-top-left">
                    <p>ថ្ងៃ <span>${e["day"]}</span> </p>  
                    <p>ព្រះនាម <span>${e["name"]}</span> </p>  
                    <p>លម្អរព្រះកាណ៌ ${e["body"]}</p>
                    <p>គ្រឿងអាភរណៈ អលង្ការត្បូង ${e["dio"]}</p>
                    <p>ភក្សាហារ ${e["foot"]}</p>
                    <p>គ្រឿងសាស្ត្រាវុធ ${e["web"]} </p>
                </div>
                <div class="detals-top-right">
                    <div class="txt-right" style="background-color: ${e["background_color"]};">
                        <p> យាន្តជំនិះ ជាសំស្ក្រឹត </p>
                        <a href="">${e["vhc"]}</a>
                    </div>
                </div>
            </div>
        `;
    }));
    document.querySelector(".contents").innerHTML = txt;
    document.querySelector(".text-title").innerHTML = "<h4>ទេវតាសង្ក្រាន្តទាំង៧</h4>";
}
fugetDetals();



