var CharKNY = [
  "សេដ្ឋីឪពុកធម្មបាលកុមារ",
  "ធម្មបាលកុមារ",
  "កបិលមហាព្រហ្ម",
  "សត្វឥន្ទ្រីញីឈ្មោល",
  "ព្រះនាងទុង្សទេវី",
  "កូនទាំង៧អង្គ របស់កបិលមហាព្រហ្ម"
]
var paragraph1 = [
  {
    "Paragraph1":"មានតំណាលថា នៅដើមនៃភទ្ទកប្បមានសេដ្ឋីម្នាក់ មានបុត្រមួយ ឈ្មោះធម្មបាលកុមារ ជាអ្នកមានចំណេះវិជ្ជាដ៏វិសេស បានរៀនចេះចប់គម្ពីរត្រីវេទតាំងពីអាយុបាន៧ឆ្នាំ។ សេដ្ឋីបិតាបានសាងប្រាសាទឲ្យ ធម្មបាលកុមារ នៅទៀបដើមជ្រៃមួយធំ នៅឆ្នេរទន្លេ ដែលជាទីស្នាក់អាស្រ័យ នៃបក្សីទាំងឡាយ។ ធម្មបាលកុមារ ចេះទាំងភាសាបក្សីទាំងពួងផង ព្រមទាំងអាចធ្វើជាអាចារ្យសម្ដែងមង្គលផេ្សងៗ ដល់មនុស្សទាំងពួងផង។"
  },
  {
    "Paragraph1":"គ្រានោះ មនុស្សលោករមែងរាប់អានមហាព្រហ្ម និងកបិលមហាព្រហ្ម១អង្គទៀត ដែលជាអ្នកសម្ដែងមង្គលដល់មនុស្សទាំងពួង។ ពេលនោះ កបិលមហាព្រហ្ម បានជ្រាបព័ត៌‌មានក៏ចុះមកសួរបញ្ហា នឹងធម្មបាលកុមារ ចំនួន៣ប្រស្នា ដោយសន្យាថា ប្រសិនបើ ធម្មបាលកុមារ អាចដោះប្រស្នាបាន កបិលមហាព្រហ្ម នឹងកាត់ព្រះសិរសាទ្រង់ដើម្បី បូជាចំពោះធម្មបាលកុមារ ប៉ុន្តែប្រសិនបើធម្មបាលកុមារ មិនអាចដោះស្រាយប្រស្នានោះរួច កបិលមហាព្រហ្មនឹងកាត់ក្បាលធម្មបាលកុមារវិញ ។"
  },
  {
    "Paragraph1":"ធម្មបាលកុមារសុំឲ្យពន្យារពេលចំនួន ៧ ថ្ងៃសិនដើម្បីគិតប្រស្នា។ លុះកន្លងទៅ៦ថ្ងៃហើយក៏ធម្មបាលកុមារនៅតែគិតមិនឃើញ និងដឹងខ្លួនថាព្រឹកនេះនឹងត្រូវស្លាប់ដោយអាជ្ញាកបិលមហាព្រហ្មជាប្រាកដ។ ដូច្នេះគួរតែរត់ ទៅលាក់ខ្លួន ពួនអាត្មាឲ្យស្លាប់ដោយខ្លួនឯងប្រសើរជាង។ ទើបធម្មបាលកុមារចុះពីប្រាសាទទៅដេកពួននៅក្រោមដើមត្នោតមួយគូ។ នៅលើដើមត្នោតនោះ មានសត្វឥន្ទ្រីញីឈ្មោលធ្វើសំបុកអាស្រ័យនៅ ។"
  }
]
var paragraph2 = [
  {
    "paragraph2":"វេលាយប់ សត្វឥន្ទ្រីញីសួរសត្វឥន្ទ្រីឈ្មោលថា ព្រឹកនេះយើងបានអាហារអ្វីធ្វើជាចំណី? ឥន្ទ្រីឈ្មោលឆ្លើយថា យើងនឹងស៊ីសាច់ធម្មបាលកុមារ ដែលត្រូវនឹងកបិលមហាព្រហ្មសម្លាប់ ព្រោះធម្មបាលកុមារដោះប្រស្នាមិនរួច ។ ឥន្ទ្រីញីសួរថា ប្រស្នានោះដូចម្ដេច? ឥន្ទ្រីឈ្មោលឆ្លើយថា: វេលាព្រឹកសិរីសួស្ដីស្ថិតនៅត្រង់ណា? ត្រូវឆ្លើយថា នៅលើផ្ទៃមុខ។ ហេតុនេះទើបមនុស្សទាំងឡាយត្រូវយកទឹកលប់មុខ ។ ប្រស្នាទី២ ចោទថា ថ្ងៃត្រង់សិរីស្ថិតនៅត្រង់ណា? ត្រូវឆ្លើយថា នៅលើទ្រូង ។ ហេតុនោះទើបមនុស្សត្រូវយកទឹកលាងទ្រូង។ ប្រស្នាទី៣ចោទថា វេលាល្ងាចសិរីស្ថិតនៅត្រង់ណា? ត្រូវឆ្លើយថានៅនឹងជើង។ ហេតុនោះ ទើបមនុស្សទាំងឡាយត្រូវយកទឹកលាងជើង។"
  },
  {
    "paragraph2":"ធម្មបាលកុមារបានឮដូច្នេះ ក៏ត្រឡប់ទៅប្រាសាទវិញ។ លុះព្រឹកឡើង កបិលមហាព្រហ្ម ក៏មកសួរប្រស្នាធម្មបាលកុមារ។ ធម្មបាលកុមារឆ្លើយដោះស្រាយ តាមដែលបានឮមក។ កបិលមហាព្រហ្ម ក៏ទទួលថាពិតជាត្រឹមត្រូវ, ព្រមចុះចាញ់ និងសុខចិត្តធ្វើតាមពាក្យសន្យារបស់ខ្លួន។ កបិលមហាព្រហ្ម ហៅទេពធីតាទាំង៧អង្គដែលជាបាទបរិចាវិកា ព្រះឥន្ទ្រ មកប្រាប់ថា ឥឡូវបិតាត្រូវកាត់ព្រះសិរសាដើម្បីបូជាចំពោះធម្មបាលកុមារ តែបើដាក់ក្បាលនោះលើផែនដី នោះនឹងកើតជាភ្លើងឆេះទាំងលោកធាតុ បើបោះទៅលើអាកាសនឹងនាំឲ្យរាំងភ្លៀង បើចោលក្នុងមហាសមុទ្រនោះទឹកនឹងរីងស្ងួតហួតអស់។ ដូច្នេះសូមឲ្យកូនទាំង៧អង្គ យកពានមកទទួលព្រះសិរសាបិតា។"
  },
  {
    "paragraph2":"ពោលរួច ព្រះអង្គក៏កាត់ព្រះសិរសាហុចទៅឲ្យព្រះនាងទុង្សទេវី ជាកូនច្បង ។ ព្រះនាង ទុង្សទេវី ក៏បានយកពានមកទទួលព្រះសិរសាបិតា រួចហែប្រទក្សិណភ្នំព្រះសុមេរុ៦០នាទី ទើបយាងទៅប្រតិស្ឋានទុក ក្នុងមណ្ឌលេះនៅក្នុងគុហាគន្ធមាលី នាភ្នំកៃលាស និងបូជាគ្រឿងទិព្វផេ្សងៗ ។ ព្រះវិស្សកម្មទេវបុត្រ ក៏និមិត្តរោងទិព្វធ្វើពីកែវ ៧ ប្រការ ឈ្មោះថា «ភគវតីសភាសាលា» ឲ្យជាទីប្រជុំនៃទេវតា។ លុះដល់គម្រប់១ឆ្នាំជា សង្ក្រាន្តត នាងទេពធីតាទាំង៧អង្គ ក៏ផ្លាស់វេនគ្នាមកអញ្ជើញ ព្រះសិរសាកបិលមហាព្រហ្ម ចេញមកហែប្រទក្សិណ ភ្នំព្រះសុមេរុជារៀងរាល់ៗឆ្នាំ រួចហើយយាងត្រឡប់ទៅស្ថានទេវលោកដើម្បីតម្កល់វិញ។"
  },
]
KNY()
function KNY() {
  var txtHis = ""
  CharKNY.forEach((e) => {
    txtHis += `
    <li>
      <p>${e}</p>
    </li>
    `
  });
  document.querySelector(".CharactersKNY").innerHTML = txtHis
}
Paragraph1()
function Paragraph1(){
  var txtPara1 = ''
  paragraph1.forEach((e)=>{
    txtPara1 += `
      <p>&nbsp;&nbsp;&nbsp;${e["Paragraph1"]}</p>
    `
  })
  document.querySelector(".Paragraph1").innerHTML = txtPara1
}
Paragraph2()
function Paragraph2(){
  var txtPara2 = ''
  paragraph2.forEach((e)=>{
    txtPara2 += `
      <p>&nbsp;&nbsp;&nbsp;${e['paragraph2']}</p>
    `
  })
  document.querySelector(".Paragraph2").innerHTML = txtPara2
}