var paragraph6_1 = [
  "ក្រោយចូលឆ្នាំខ្មែរមួយថ្ងៃ ពោលគឺថ្ងៃទី១៧ គណៈសង្ឃទាំង៣និកាយ នៃព្រះរាជាណាចក្រកម្ពុជា និង ប្រាប់ឱ្យ ព្រះសងរាជ្យគ្រប់វត្ត នាំព្រះសង្ឃគ្រប់ៗអង្គ ចេញមកប្រស់ព្រំ ទឹកមន្តតាមភូមិស្រុករបស់ប្រជាជនខ្មែរ ដើម្បីបោសសំអាតនៅអំពើអាក្រក់ដែលកើតមាននៅក្នុងប្រទេសកម្ពុជាពីមុនមក រំលឹកនៃការចងចាំ ថ្ងៃ១៧ មេសា ដែលពួក ខ្មែរក្រហម បានចូលមកកាន់កាប់ដឹកនាំប្រទេសកម្ពុជាទាំងស្រុងរហូតដល់មានការកាប់សម្លាប់ប្រជាពលរដ្ឋអស់រាប់លាននាក់ ។ ព្រះសង្ឃគ្រប់អង្គ នាថ្ងៃរសៀលនេះ និង ចេញមកដង្ហែរ ព្រះពុទ្ធបដិមារ ជាមួយទេវរូបរបស់ សាសនាព្រហ្មញ្ញ មាន ព្រះវិស្ណុ ព្រះព្រហ្ម ព្រះឥសូរ ព្រះគណេស ជាមួយនិងការ សូត្រមន្តប្រស់ព្រំទឹក ដើម្បីបណ្ដេញ ពពួកបិសាច ដែលនាំយកភាពមិនល្អ មកថ្ងៃទី១៧នេះ ។"
]
var paragraph6_2 = [
  "តំណាលនិទាន មាននិទានអំពីថ្ងៃទី១៧ មេសា ដែលឆ្លងសករាជរួច ដែលច្រកទ្វារបិសាច និង ច្រកទ្វារទេវតាបានបើកដំណាលគ្នា បង្កើតបានជាចម្បាំងរវាងពួកទេវតា និង ពួកបីសាច ពួកទេវតាបានបើកច្រទ្វារទាំង២១ ដើម្បីចេញធ្វើចម្បាំងនិងពួកបីសាច ដូចនេះហើយទើបពលរដ្ឋខ្មែរមាននូវកិច្ច ជំនឿការអុជធូប ទាំង២១សសៃ ដើម្បីឧទ្ទិសសំបូងរូង មកដល់បញ្ចុប្បន្ននេះ ។ នៅក្នុងព្រះគុម្គីរពុទ្ធសាសនាមហាយាន នាប្រទេសចិន បាននិទានអំពីពួកបីសាច ដែលដឹកនាំដោយស្ដេចបីសាចឈ្មោះ (អូធាន) បានច្បាំងដណ្ដើមកាន់កាប់ឋានសួគ៌របស់ព្រះឥន្ទនាពេលនោះ ខាងទេវតាបានច្បាំងចាញ់ ហើយពួកបីសាចបានគ្រប់គ្រងនៅឋានទាំង៣ ដើម្បីបង្ក្រាបពួកបីសាចបាន ព្រះពុទ្ធ បានទៅចាប់បដិសន្ធិជា មនុស្សលោក មករួមនិងពួកទេវតា ចេញមកប្រយុទ្ធជាមួយនិងពួកបីសាច ទើបអាចយកឈ្នះពួកបីសាចបាន និទានចង់ពន្យល់ថា ព្រោះបើព្រះពុទ្ធ សម្លាប់ពួកបិសាច ក្នុងទម្រង់ជាព្រះ នោះទ្រង់និងដាច់អបត្តិដោយការសម្លាប់សត្វ មិនអាចក្លាយជាព្រះអរហន្តឡើយ ។"
]
var paragraph6_3 = [
  "ក្នុង​រយៈ​ពេល​ ៣៦៥ ​ថ្ងៃ ពិធី​ចូល​ឆ្នាំ​មាន​ត្រឹម​តែ ​៣ ​ថ្ងៃ​ទេ និង ​ចំ​រដូវ​ដែល​មាន​អាកាសធាតុ​ក្ដៅ (ខែ​ចេត្រ) ដែល​អត្ថន័យ​ នៃ​ពិធី​នេះ មិន​ខុស​អី​ពី​ការ​សំដែង​ដឹង​គុណ​ដល់​អ្នក​មាន​គុណ​នោះ​ដែរ ព្រោះ​ព្រះ​បដិមា​សំដៅ​លើ​ព្រះពុទ្ធ​ ដែល​ជា​ព្រះ​សំដែង​ធម៌​ទេសនា​ប្រោស​មនុស្ស​សត្វ​អស់​កាល​ដ៏​យូរ ដូច្នេះ​ ពុទ្ធបរិស័ទ​មក​សំដែង​គុណ​ដោយ​ធ្វើ​ពិធី​ស្រង់​ព្រះ លាង​ស្រោច​ដោយ​ទឹក​អប់​ផ្កាភ្ញី​ជម្រះ​ធូលី​ឲ្យ​ត្រជាក់។ ចំណែក​ឯ​មាតាបិតា ឬ​ចាស់​ព្រឹទ្ធាចារ្យ ឬ​មាន​គុណ កូន​ចៅ​មក​ស្រោច​ទឹក ឬ​ងូត​ទឹក​ដុស​ក្អែល​ឲ្យ ក៏​ដើម្បី​បង្ហាញ​ពី​ការ​ដឹង​គុណ និង ​ឲ្យ​បាន​ត្រជាក់ ពី​​ឆ្នាំ​ចាស់​ផ្លាស់ឆ្នាំ​ថ្មី ​ទាំង​អស់​គ្នា៕"
]
GetParagraph6_1()
function GetParagraph6_1(){
  var txtParagraph6_1 = ""
  paragraph6_1.forEach((e)=>{
    txtParagraph6_1 += `
    <p>${e}</p>
    `
  })
  document.querySelector(".paragraph6-1").innerHTML = txtParagraph6_1
}
GetParagraph6_2()
function GetParagraph6_2(){
  var txtParagraph6_2 = ""
  paragraph6_2.forEach((e)=>{
    txtParagraph6_2 += `
    <p>${e}</p>
    `
  })
  document.querySelector(".paragraph6-2").innerHTML = txtParagraph6_2
}
GetParagraph6_3()
function GetParagraph6_3(){
  var txtParagraph6_3 = ""
  paragraph6_3.forEach((e)=>{
    txtParagraph6_3 += `
    <p>${e}</p>
    `
  })
  document.querySelector(".paragraph6-3").innerHTML = txtParagraph6_3
}