var paragraph4_1 = [
  "តាមទំនៀមចូលឆ្នាំខ្មែរ គេចែកវេលាចូលឆ្នាំជា ៣ថ្ងៃ ថ្ងៃទី១ ហៅថា៖ ថ្ងៃ មហាសង្ក្រាន្ត , ថ្ងៃទី២ ហៅថា៖ ថ្ងៃ វារៈវ័នបត, ថ្ងៃទី៣ ហៅថា៖ ថ្ងៃ វារៈឡើងស័ក, រីឯការកំណត់ថ្ងៃ ម៉ោង នាទីដែលឆ្នាំចាស់ត្រូវផុតកំណត់ ហើយទេវតាឆ្នាំថ្មីត្រូវចុះមកទទួលតំណែងពីទេវតាឆ្នាំចាស់នោះ គេអាចដឹងបានដោយប្រើក្បួន ហោរាសាស្ត្រខ្មែរបុរាណ គឺក្បួនមហាសសង្ក្រាន្ត តាមរយៈក្រុមព្រា្មណ៍ បាគូ ប្រចាំនៅក្នុង ព្រះបរមរាជវាំង ។ ប្រសិនបើថ្ងៃចូលឆ្នាំនាឆ្នាំបន្ទាប់ ជាន់គ្នានិងឆ្នាំចាស់ គេត្រូវបន្ថែមថ្ងៃវ័នបត មួយថ្ងៃទៀត ដែលធ្វើឱ្យថ្ងៃវ័នបតមានចំនួនដល់ទៅ ២ថ្ងៃ ហើយថ្ងៃទី២ នៃថ្ងៃវ័នបត ត្រូវបានចាត់ទុក ជាថ្ងៃខ្វាក់  ដែលធ្វើឱ្យទំនៀមនៃថ្ងៃចូលឆ្នាំ មានរហូតដល់ ៤ថ្ងៃ ។ ថ្ងៃចាប់ផ្ដើម នៃពិធីបុណ្យចូលឆ្នាំខ្មែរ ត្រូវបានចាត់ទុកជាថ្ងៃពិសេសមួយ នៃកិច្ចពិធីសែនទទួលទេវតាឆ្នាំថ្មី ដែលកំណត់ការសែនព្រេន តាមម៉ោងកំណត់យាងមករបស់ទេវតា ដែលពលរដ្ឋខ្មែរគ្រប់រូប បានរៀបចំនូវគ្រឿងរណ្ដាប់ទទួលទេវតា ផងដែរ ។"
]
var listDay = [
  "មានកូនចេកកន្ទុយប្រឺស១","ផ្ទិលមាស១ ឬ ផ្ទិលប្រាក់១","បាយ​សី​ធំ ១​គូ","ស្លាធម៌ ១​គូ","ទឹក​អប់ ១​គូ","ទៀន ៥ ធូប ៥ ១​គូ","លាជ ៥​កែវ","ផ្កា ៥​កែវ","ស្លា​បារី​ដាក់​ជើង​ពាន ១​គូ","ចេកនួន ឬ​ចេក​ណាំវ៉ា ១​គូ","ពែ​ព្រះ​ភូមិ​១ ពែ​ព្រះ​កេតុ​១ មានផ្លែឈើ នំចំនី និង ភេសជ្ជៈ"
]

GetParagraph4_1()
function GetParagraph4_1(){
  var txtParagraph4_1 = ""
  paragraph4_1.forEach((e)=>{
    txtParagraph4_1 += `
    <p>${e}</p>
    `
  })
  document.querySelector(".Paragraph4-1").innerHTML = txtParagraph4_1
}
GetListDay()
function GetListDay(){
  var txtList = ""
  listDay.forEach((e)=>{
    txtList += `
      <li>${e}</li>
    `
  })
  document.querySelector(".ListDday").innerHTML = txtList
}