var Paragrph7_1 = [
  "ក្នុងកំឡុងពេលចូលឆ្នាំ កូនចៅរៀបចំវត្ថុជាច្រើនមុខ យ៉ាងសមរម្យ មានសំលៀកបំពាក់ថ្មីថ្មោងនិងចំណីអាហារ យកទៅជូនដល់មាតាបិតា ជីដូនជីតា និង គ្រូបាធ្យាយ ។ ការធ្វើ​រ​បៀបនេះ បង្ហាញ់ឲ្យឃើញនូវការគោរពនិងការដឹងគុណរបស់កូនចៅចំពោះអ្នកមានគុណ និង ចាស់ព្រឹទ្ធាចារ្យ ។ គ្រួសារបរិច្ចាកលុយ​កាក់ដាក់ទានដល់ជនក្រីក្រ ដល់អ្នកបម្រើ និងគ្រួសារទុគ៌តទាំងឡាយ រួចហើយគេនាំគ្នាទៅវត្ត ដើម្បីធ្វើបុណ្យ​ឧទ្ទិសកុសលដល់បុព្វការីជន ។ ក្នុងថ្ងៃទី ២ នេះ ពុទ្ធបរិស័ទនិយមធ្វើពិធីពូនភ្នំខ្សាច់ គេពូនភ្នំធំមួយចំកណ្ដាល និងភ្នំតូចៗ បួនសង្ខាង ធ្វើរាជវ័តព័ទ្ធជុំវិញ មានទ្វារចេញចូលបានទាំងបួនទិស​ ដែលហៅថា វាលុកចេតិយ ។"
]
var list7_1 = [
  "ល្បែងស្ដេចចង់ ឬអៀវ","ល្បែងទាញព្រ័ត្រ","ល្បែងកូនគោល","ល្បែងចត្រង្គ ឬអុក","ល្បែងស្វាដណ្ដើមស្លឹកឈើ","ល្បែងបាយខុំ","ល្បែងប្រជល់មាន់","ល្បែងប៉ក់ចាប","ល្បែងរាវបង្កង","ល្បែងចោលឈូង","ល្បែងចាប់កូនខ្លែង","ល្បែងគ្របមាន់","ល្បែងបោះអង្គញ់","ល្បែងលោតអន្ទាក់","ល្បែងលាក់កូនកាស","ល្បែងគោះត្រឡោក","ល្បែងទាត់សី","ល្បែងបិទពួន","ល្បែងចោះប្រមាត","ល្បែងលាក់ធ្យូង","ល្បែងលាក់កន្សែង","ល្បែងឳបត្រឡាច"
]
GetParagraph7_1()
function GetParagraph7_1(){
  var txtParagraph7_1 = ""
  Paragrph7_1.forEach((e)=>{
    txtParagraph7_1 += `
      <p>${e}</p>
    `
  })
  document.querySelector(".paragraph7_1").innerHTML = txtParagraph7_1
}
GetList7_1()
function GetList7_1(){
  var txtList7_1 = ''
  list7_1.forEach((e)=>{
    txtList7_1 += `
      <li>${e}</li>
    `
  })
  document.querySelector(".list7_1").innerHTML = txtList7_1
}