var Paragraph1 = [
  "ថ្ងៃទី១ ហៅថា (មហាសង្ក្រាន្ត) មានន័យថា ឆ្នាំថ្មីដ៏ប្រសើរ (The Great New Year) ដែលសម្គាល់ទៅលើការប្រារព្ធពិធីចូលឆ្នាំថ្មីដ៏ធំ ដែលរាប់បញ្ចូលគ្នា នៃការផ្លាសឆ្នាំ របស់ មហាសករាជ ចុល្លសករាជ ពុទ្ធសករាជ ក្នុងថ្ងៃតែមួយតាងដោយ ពិធីត្រុដិ ដែលជាកិច្ចពិធីផ្ដាច់ឆ្នាំចាស់។ ដោយពាក្យថា (សង្ក្រាន្ត) ( ន. ) សង់ក្រាន សង្ក្រាន្ត សង្រ្កាន្តិ ( សំ. ) (សង្រ្កាន្តិ) មានន័យថា៖ ដំណើរ​ឃ្លាត​ចាក​ទី; ការ​ឈាន​ចូល​ដល់; ដំណើរ​ដែល​ព្រះ​អាទិត្យ​ចរ​ចូល​ដល់​ទី​ជួបមួយ​ជុំ​រាសី​ចក្រ គឺ​ដំណើរ​ដែល​ដើម​និង​ចុង​នៃ​រាសី​ចក្រ​ជួបគ្នា ពេញ​គ្រប់​ជា​មួយ​ឆ្នាំ (ដំណើរ​ដាច់​ឆ្នាំ​ចាស់​ផ្លាស់​ឆ្នាំ​ថ្មី), ពិធី​ចូល​ឆ្នាំ​ថ្មី សង្រ្កាន្ត​មាន​បី​ថ្ងៃ​គឺ​ថ្ងៃ​ទី ១ ជា​ថ្ងៃ​ចូល​ឆ្នាំ, ថ្ងៃ​ទី ២ ជា ពារ​កណ្ដាល ឬ​ហៅ​ថា វ័នបត (ថ្ងៃ​ខ្វាក់), ថ្ងៃ​ទី ៣ ជា ពារ​ឡើង​ស័ក គឺ​ផ្លាស់​ស័ក​ថ្មី​នៅ​ថ្ងៃ​នេះ​ឯង : ថ្ងៃ​សង្រ្កាន្ត, ពិធី​សង្រ្កាន្ត ។"
]
var List1 = [
  {
    "desList1":"បើទេវតាថ្ងៃអាទិត្យ ព្រះនាម <span>ទុង្សាទេវី</span>  យាងចុះមក ដោយកិរិយាចេញច្បាំង នៃវេលាណាមួយក្នុង វេលាទាំង ៤ នោះ ព្រះនគរច្រើនមានវិបត្តិអំពី ទិន្នផលកសិកម្ម កើតឡើងបណ្ដាលអំពីគ្រោះរាំងស្ងួត ។"
  },
  {
    "desList1":"បើទេវតាថ្ងៃច័ន្ទ ព្រះនាម <span>គោរាគៈទេវី</span> យាងចុះមក ដោយកិរិយាចេញច្បាំង នៃវេលាណាមួយក្នុង វេលាទាំង ៤ នោះ បណ្ដាលមន្ត្រីអ្នកមុខអ្នកការ ច្រើនអស់បុណ្សស័ក្ដិ និង អាប់យ័ស្ត ។"
  },
  {
    "desList1":"បើទេវតាថ្ងៃអង្គារ ព្រះនាម <span>រាក្យៈសាទេវី</span>  យាងចុះមក ដោយកិរិយាចេញច្បាំង នៃវេលាណាមួយក្នុង វេលាទាំង ៤ នោះ ព្រះនគរ និង កើតចម្បាំងរាំងជល់ និង បញ្ចាមិត្ត កើតកលយុគ្គសង្គ្រាម ឬ មានទំនាស់និង ប្រទេសដ៍ទៃ និង សំបូរទៅដោយជំងឺរាតត្បាតជាអនេក ។"
  },
  {
    "desList1":"បើទេវតាថ្ងៃពុធ ព្រះនាម <span>មណ្ឌាទេវី</span>  យាងចុះមក ដោយកិរិយាចេញច្បាំង នៃវេលាណាមួយក្នុង វេលាទាំង ៤ នោះ តាងអំពីព្រះមហាក្សត្រ និង តាងអំពីក្រុមមន្ត្រី ច្រើនទទួលបាន គ្រឿងបណ្ដាការ និង ការលើកសរសើរយ័ស្តពីប្រទេសដទៃ ប៉ុន្តែក្មេងៗតូច ច្រើនកើតជំងឺតម្កាត់ផ្សេងៗរងគ្រោះជាអនេក ។"
  },
  {
    "desList1":"បើទេវតាថ្ងៃព្រហស្បតិ៍ ព្រះនាម <span>កិរិណីទេវី</span>  យាងចុះមក ដោយកិរិយាចេញច្បាំង នៃវេលាណាមួយក្នុង វេលាទាំង ៤ នោះ ព្រះពិក្ខុសង្ឃ គណៈសង្ឃ និង ជនចាស់ជរាទាំងឡាយ ច្រើនមានសេចក្ដីទោម្នេញក្ដៅក្រហាយចិត្តជាច្រើនអនេក ផ្ទៃមេឃពោពេញ ដោយព្យុះភ្លៀងផ្គររន្ទះ ។"
  },
  {
    "desList1":"បើទេវតាថ្ងៃសុក្រ ព្រះនាម <span>កិមិរាទេវី</span>  យាងចុះមក ដោយកិរិយាចេញច្បាំង នៃវេលាណាមួយក្នុង វេលាទាំង ៤ នោះ ដំណាំផល្លានុផល ស្រូវអង្ករ ប្រកបដោយភាពបរិបូរណ៌ ប៉ុន្តែផ្ទៃមេឃពោពេញ ដោយខ្យល់ច្រើន បណ្ដាលឱ្យមាននូវព្យុះសង្ឃរាធំៗ ។"
  },
  {
    "desList1":"បើទេវតាថ្ងៃសៅរ៍ ព្រះនាម <span>មហោទរាទេវី</span>  យាងចុះមក ដោយកិរិយាចេញច្បាំង នៃវេលាណាមួយក្នុង វេលាទាំង ៤ នោះ ព្រះនគរនិងមានគ្រោះអន្តរាយ បណ្ដាលហេតុមកពីភ្លើង កើតមានវិបត្តិប្រាក់កាក់ និងកើតមានចោរកម្មច្រើន ។"
  },
]
var Paragraph2 = [
  "ពលរដ្ឋខ្មែរមួយចំនួនធំ តែងឆ្ងង់ថា ហេតុអ្វីកម្ពុជាមិនមានរូភាព ឬ វីដេអូ ឯកសារអំពីការហែរទេវតា មហាសង្ក្រាន្ត ពីអតីតកាល ក៏ដូចជា ពីសម័យសង្គមរាស្ត្រនិយម ក៏ដូចជាសម័យសាធារណៈរដ្ឋខ្មែរ នោះក៏ដោយសារតែ កាហែរក្បួនតំណាងទេវតា មហាសង្ក្រាន្ត បុរាណចារ្យ ចាត់ទុកជាភាពមុឺងម៉ាត់ ម៉ត់ចត់ មិនអាចធ្វើលេងសើច និង ធ្វើឱ្យរួចពីដៃបានឡើយ បើថវិកាមិនដល់សម្រេចមិនធ្វើតែម្ដង ។ "
]

var list2 = [
  {
    "desList2":"<span>ប្រការទី១៖</span> បុរាណចារ្យ ត្រូវជ្រើសរើសយកមនុស្សស្រីរូបណា ដែលមានរូបសម្បត្តិល្អស្អាត និង ត្រូវមានកិរិយាមាយាទល្អ ។"
  },
  {
    "desList2":"<span>ប្រការទី២៖</span> សម្លៀកបំពាក់ទេវតាត្រូវធ្វើពីតម្បាញសូត្រល្អបំផុត ជាមួយនិងការចាក់ខ្សែរមាស ប្រដេញជាមួយគ្រាប់អង្កាំយ៉ាងសម្រិតសម្រាង ។"
  },
  {
    "desList2":"<span>ប្រការទី៣៖</span> គ្រឿងអភរណៈ រឺយើងស្គាល់ថា ត្បូងលម្អកាយរបស់ទេវតា ត្រូវគ្រងដោយត្បូងមានតម្លៃពិតប្រាកដ និង ប្រើប្រាសដោយចំនួនច្រើន មានជាអាថ៍ ខ្សែរក ខ្សែរដៃ ជញ្ជៀន ការដាំនៅលើស្បៃឆៀង ការដាំនៅលើមកុដ ផងដែរ ។"
  },
  {
    "desList2":"<span>ប្រការទី៤៖</span> ព្រះមកុដរបស់ទេវតាសង្ក្រាន្ត ត្រូវធ្វើពីមាសសុទ្ធ និង មានដាំនូវត្បូងជាច្រើន និង មានដាំនៅគ្រាប់ពេជ្រផងដែរ ។"
  },
  {
    "desList2":"<span>ប្រការទី៥៖</span> គ្រឿងសាស្ត្រាវុធ របស់ទេវតាសង្ក្រាន្ត ត្រូវធ្វើពីឈើខ្លឹមល្អៗ ការសិតដោយមានខ្នាតច្បាស់លាស់ អមទៅដោយការស្រោបគ្រឿងមាស និង គ្រឿងប្រាក់ ឬ ធ្វើចេញមកពីភ្លុកដំរីផងដែរ ។"
  },
  {
    "desList2":"<span>ប្រការទី៦៖</span> ទេវតាសង្ក្រាន្ត ត្រូវយាងប្រថាប់លើរាជរថ ដែលមានក្បាលសត្វពាហណៈ ដែលតំណាងឱ្យយានជំនិះរបស់ទេវតានីមួយៗផងដែរ ។ នៅពីលើរាជរថ ត្រូវបាំងដោយ ឆត្រអភិរម្យ និង ត្រូវមានព្រះមន្ត្រីឆ្មាំ ចំនួន ២៧ អង្គ ចែកចេញជា ៣ ជួរតាមហែរហម រាជរថនេះផងដែរ ។ នៅក្នុង រាជរថនេះដដែល ត្រូវមានព្រះភីលៀង ២ អង្គឈរកាន់ផ្លិតសែនត្វ័ននៃជំហៀងម្ខាងៗ សម្រាប់បាំងខ្យល់ឱ្យតួឯកទេវតា និង ៤ អង្គទៀតផ្នែកខាងក្រោយត្រូវកាន់ផ្លិត បាំងសែង បាំងសូន សម្រាប់ការបាំងកាំរស្មីពន្លឺដល់ទេវតា និង ២ អង្គទៀតត្រូវកាន់ផ្លិត វិជនី សម្រាប់បក់នាំនូវវាយោដល់តួឯកទេវតា ។"
  },
  {
    "desList2":"<span>ប្រការទី៧៖</span> ព្រះសិរសា កុបិលមហាព្រហ្មត្រូវមានព្រះភ័ក្រ ធ្មេចព្រះនេត្រ រលត់ខន្ធ (khandha) គឺ​ជាពាក្យបាលី ដែល​ត្រូវ​​នឹង​ពាក្យ​ថា​ ស្កន្ធ (skandha) នៅ​ក្នុង​ភាសា​សំស្រ្កឹត ។ ខន្ធ​ គឺជា​បាតុភូត នៃញាណ ទាំង៥ យ៉ាង ដែល​ជាមូលដ្ឋាននៃវិញ្ញាណ​ឲ្យដឹងអំពីខ្លួន​ ។ នៅ​ក្នុងបញ្ចក្ខន្ធ​គ្មានអ្វីជា ​របស់​អញទេ ចំណែកទ្រឹស្តី​​​ពុទ្ធសាសនា​ថេរវាទ អះអាង​ថា​ សេចក្តី​ទុក្ខកើតឡើង​នៅ​ពេល​​ណា​ចិត្ត​មនុស្ស​​ជាប់ជំពាក់ (ឧបាទាន) ជាមួយនឹងខន្ធ ៥ ឬ ញាណទាំង៥ របស់មនុស្ស ដូចនេះហើយទើបពលរដ្ឋខ្មែរបច្ចុប្បន្ន ផ្សារភ្ជាប់និង ជំនឿការអុជធូប ៥សរសៃ ដើម្បីឧទ្ទិសដល់អរុក្ខ អារ័ក្ស អ្នកតា ទេវតា មកដល់ពេលបច្ចុប្បន្ននេះ ។"
  },
  {
    "desList2":"<span>ប្រការទី៨៖</span> ព្រះសិរសា កុបិលមហាព្រហ្ម ត្រូវដាក់នៅលើ រាជរថបុស្បុក ដែលមានក្បាលនាគចំនួន ៣៨ តំណាងឱ្យ អភិប្រាយ​មង្គលសូត្រ ៣៨ ប្រការ ផងដែរ ។ គេត្រូវជ្រើសយក មនុស្សប្រុសមានមាឌធំតែងជាទេវតា រក្សាទិសធំទាំង៤ ដើរអមនៅក្បួនរាជរថ ជាមួយនិង ព្រះមន្ត្រី ដែលស្លៀកពាក់ជាមន្ត្រីកងទ័ពទេវតាតាមដង្ហែរក្បួន ចំនួន ២៧ អង្គផងដែរ ។"
  },
  {
    "desList2":"<span>ប្រការទី៩៖</span> ដែលជាប្រការចុងក្រោយ ត្រូវមានក្រុមភ្លេងទេវតា ប្រដាប់ទៅដោយ គ្មោះ ស្គរ និង ក្រុមភ្លេងពិណពាទ្យ ជាមួយនិង ទេវតាកាន់ជ័យទង់ ផងដែរ ។"
  },
]

GetParagraph1()
function GetParagraph1() {
  var txtParagraph1 = ""
  Paragraph1.forEach((e)=>{
    txtParagraph1 += `
      <p>&nbsp;&nbsp;&nbsp;${e}</p>
    `
  })
  document.querySelector(".Paragraph1-1").innerHTML = txtParagraph1
}

GetdesList1()
function GetdesList1(){
  var txtDesList1 = ""
  List1.forEach((e)=>{
    txtDesList1 += `
    <li>
      <p>${e["desList1"]}</p>
    </li>
    `
  })
  document.querySelector(".list1-1").innerHTML = txtDesList1
}

GetParagraph2()
function GetParagraph2(){
  var txtParagraph2 = ''
  Paragraph2.forEach((e)=>{
    txtParagraph2 += `
      <p>&nbsp;&nbsp;&nbsp;${e}</p>
    `
  })
  document.querySelector(".Paragraph1-2").innerHTML = txtParagraph2
}

GetdesList2()
function GetdesList2(){
  var txtDesList2 = ""
  list2.forEach((e)=>{
    txtDesList2 += `
      <li><p>${e["desList2"]}</p></li>
    `
  })
  document.querySelector(".list1-2").innerHTML = txtDesList2
}