var KNYDay3Paragraph3_1 = [
   "ថ្ងៃទី៣ ហៅថា (វារៈឡើងស័ក) មានន័យថា ការផ្លាសប្ដូរ លំដាប់ស័ក នៃឆ្នាំសករាជ (Saka Era) ដែលមានស័កទាំង១០ ដូចជា៖ ឯក​ស័ក, ទោស័ក, ត្រី​ស័ក, ចត្វាស័ក, បញ្ចស័ក, ឆស័ក, សប្តស័ក, អដ្ឋស័ក, នព្វស័ក, សំរឹទ្ធិស័ក ដើម្បីសម្គាល់ឆ្នាំ នៃក្បួនហោរាសាស្ត្រក្នុងការគណនា ចុល្លសករាជ និង មហាសករាជ ចងក្រងដោយលោក Félix Gaspard Faraut ក្នុងឆ្នាំ ១៩១០ ដោយសៀវភៅនោះមានឈ្មោះថា (Astronomie Cambodgienne) លោកបានរៀនក្បួនតម្រាតារាសាស្ត្រខ្មែរនេះ ពីលោកឧកញ៉ាធិបតី ចាងហ្វាងដួង ។"
]
var KNYDay3Paragraph3_2 = [
  "ថ្ងៃទី ៣ នៃថ្ងៃឡើងស័ក មានការស្រង់ ព្រះពុទ្ធបដិមាករ និង ព្រះរស់ ដែលមានន័យថា មាតា​បិតា ឬ ជីដូនជីតា ។ ការងូតទឹកជម្រះកាយជូនចំពោះ មាតាបិតា ឬ ជីដូនជីតា កូនចៅបានទទួលនូវពរសព្វសាធុ​ការ ក៏ដូចជាការដឹងគុណ ចំពោះពួកគាត់ក្នុងការផ្ដល់កំណើត និង កិច្ចខិតខំបីបាច់ថែរក្សា ដែលពួកគាត់មានចំពោះកូនៗ កិច្ចតបស្នងនេះហើយ ដែលកូនចៅទទួលបានដំបូន្មានល្អៗ សម្រាប់អប់រំខ្លួន ក៏ដូចជាសាបព្រួសនូវទង្វើរដ៏ល្អនេះចំពោះកូនចៅជំនាន់ក្រោយរបស់ពួកគេផងដែរ ។ មហាសង្ក្រាន្តសូត្រ ក្នុងគម្ពីរ សុត្តជាតក បញ្ជាក់ថាអានិសង្សនៃការស្រង់ទឹក ព្រះសង្ឃ និង មាតាបិតា កាល​ថ្ងៃ​សង្ក្រាន្តចូលមកជិតដល់ព្រះបាទ (បសេនទិកោសល) បានរៀបចំឆាកយ៉ាងស្អាត នៅឆ្នេរស្ទឹងមួយរួចហើយក៏និមន្ត​ព្រះពុទ្ធ និង ព្រះសង្ឃស្រង់ទឹក ដោយមានសមាទានសីល ប្រគេនភត្តាហារចំពោះព្រះពុទ្ធ និង ព្រះសង្ឃទាំងអស់ ក្នុងទីនោះផង ។ ដោយមានក្នុងពំនោលថា៖ អ្នកណាបានស្រង់ទឹកព្រះសង្ឃ មាតាបិតា និង គ្រូឧបជ្ឈាយ៍ និងបាន​ទទួលអានិសង្សច្រើនណាស់ លុះដល់អនាគតជាតិនិងបានទៅកើតក្នុងទេវលោកឋាននិងបានជាស្ដេចចក្រ​ពត្តិ​ មានបុណ្យបារមីច្រើន មានរូបសម្បត្តិល្អ មានទ្រព្យសម្បត្តិច្រើន មានសេចក្ដីសុខគ្រប់បែបយ៉ាង ។"
]
var KNYDay3Paragraph3_3 = [
  "ក៏ដូចជាតាមរយៈកំណត់ត្រាលោក ទេពពិទូរ ឈឹម ក្រសេម ការស្រង់បានបដិមា ព្រះកែវមរកត ក្នុងរាជព្រះបាទ សូរ្យវរ្ម័នទី១ ទ្រង់សោមនស្សណាស់ឱ្យទទួលទុកក្នុងព្រះបរមរាជវាំង ក្នុងរវាងឆ្នាំ ១០៤០ នៃគ​.សករាជ ជាមួយនិងកិច្ចពិធីស្រង់ព្រះផងដែរ ហើយភាពល្បីល្បាញនៃកិច្ចពិធីបានដឹងដល់ ព្រះបាទ អនុរុទ្ធ ដែលសោយរាជ្យសម្បត្តិផ្លូវការណ៍ នៃអាណាចក្របាកាន បានជ្រាបដឹងដំណឹងនេះទ្រង់បានត្រាសបញ្ជារ ឱ្យរាជបំរើនាំរាជសារមកស្នើសុំយកព្រះកែវមរកត ត្រឡប់ទៅកាន់ប្រទេសភូមាវិញផងដែរ តាមរយៈកំណត់ត្រានេះ យើងអាចយល់បានថា កិច្ចពិធីស្រង់ព្រះពុទ្ធអង្គ អាចនិងកើតមានតាំងពីសម័យកាលអង្គរមកម៉្លេះ ។"
]
GetKNYDay3_1()
function GetKNYDay3_1(){
  var txtKNYDay3_1 = ""
  KNYDay3Paragraph3_1.forEach((e)=>{
    txtKNYDay3_1 += `
      <p>${e}</p>
    `
  })
  document.querySelector(".Paragraph3-1").innerHTML = txtKNYDay3_1
}
GetKNYDay3_2()
function GetKNYDay3_2(){
  var txtKNYDay3_2 = ""
  KNYDay3Paragraph3_2.forEach((e)=>{
    txtKNYDay3_2 += `
      <p>${e}</p>
    `
  })
  document.querySelector(".Paragraph3-2").innerHTML = txtKNYDay3_2
}
GetKNYDay3_3()
function GetKNYDay3_3(){
  var txtKNYDay3_3 = ""
  KNYDay3Paragraph3_3.forEach((e)=>{
    txtKNYDay3_3 += `
      <p>${e}</p>
    `
  })
  document.querySelector(".Paragraph3-3").innerHTML = txtKNYDay3_3
}
