var KNYDay2 = [
  {
    "description":"ថ្ងៃទី២ ហៅថា (វារៈវ័នបត) មានន័យថា ថ្ងៃផ្ដល់ផល្លានុផល ឬ ការផ្ដល់ជូន នូវអំណោយបន្តិចបន្តួច ដើម្បីជួយទៅដល់ ជនក្រីក្រ អ្នកបម្រើ អ្នកដែលគ្មានផ្ទះ សំបែង និង ជនក្រីក្រជាច្រើនទៀត ​ក្រុមគ្រួរសារ​ យកចិត្តទុកដាក់ ទៅលើការឧទិ្ទស ផល្លានុផលទៅដល់ ជីដូនជីតា ឬ អ្នកមានគុណរបស់ពួកគេ ដើម្បីទទួលបាននូវអានិសង្ស ។",
    "description-img":"../img/family.jpg"
  },
  {
    "description":"ថ្ងៃទី ២ នៃថ្ងៃវ័នបត ម្នាក់ ៗ ភ្ញាក់ពីព្រលឹម ខុសពីធម្មតា កូនចៅរៀបចំវត្ថុជាច្រើនមុខ យ៉ាងសមរម្យ មានសំលៀកបំពាក់ថ្មីថ្មោងនិងចំណីអាហារ យកទៅជូនដល់មាតាបិតា ជីដូនជីតា និង គ្រូបាធ្យាយ ។ ការធ្វើ​រ​បៀបនេះ បង្ហាញ់ឲ្យឃើញនូវការគោរពនិងការដឹងគុណរបស់កូនចៅចំពោះអ្នកមានគុណ និង ចាស់ព្រឹទ្ធាចារ្យ ។ គ្រួសារបរិច្ចាកលុយ​កាក់ដាក់ទានដល់ជនក្រីក្រ ដល់អ្នកបម្រើ និងគ្រួសារទុគ៌តទាំងឡាយ រួចហើយគេនាំគ្នាទៅវត្ត ដើម្បីធ្វើបុណ្យ​ឧទ្ទិសកុសលដល់បុព្វការីជន ។ ក្នុងថ្ងៃទី ២ នេះ ពុទ្ធបរិស័ទនិយមធ្វើពិធីពូនភ្នំខ្សាច់ គេពូនភ្នំធំមួយចំកណ្ដាល និងភ្នំតូចៗ បួនសង្ខាង ធ្វើរាជវ័តព័ទ្ធជុំវិញ មានទ្វារចេញចូលបានទាំងបួនទិស​ ដែលហៅថា វាលុកចេតិយ ។ វាលុក​ចេតិយ គឺជាតំណាង ចុឡាមណីចេតិយ ជាទីដែលពួកទេព្ដាសាងបញ្ចុះព្រះមោលី (ព្រះកេសធាតុ) និង ព្រះទាឋាធាតុ (ព្រះចង្កូមកែវ) របស់ព្រះសម្មាសម្ពុទ្ធជាម្ចាស់ នៅឯឋានត្រៃត្រឹង្ស ដោយសំគាល់ថា បានផលានិ​សង្សច្រើនផង បានរួចរំដោះអំពីគ្រោះចង្រៃ ក្នុងឆ្នាំចាស់ចេញស្រឡះផង និងបានទទួលសិរីសួស្ដី ក្នុងឆ្នាំថ្មីពេញមួយឆ្នាំ ម្យ៉ាងទៀត ខ្មែរយើងតែងមានជំនឿថា គ្រាប់ខ្សាច់មួយ​គ្រាប់ៗ ដែលចាក់ពូននោះ អាចផ្ដល់អានិសង្សដល់អ្នកដែលបានពូននោះឲ្យបានរួចរំដោះនូវបាបគ្រោះនិងកម្ម​ពៀរវេរាទាំងពួងទៀតផង ។",
    "description-img":"../img/vart.jpg"
  },
  {
    "description":"មហាសង្ក្រាន្តសូត្រ ក៏បានបញ្ជាក់ អំពីអានិសង្សនៃការពូនភ្នំខ្សាច់នោះថា 'ពេលសង្ក្រាន្តថ្មីចូលមកដល់ ព្រះបាទ​បសេនទិកោសល' បានចូលទៅទូលសួរ ព្រះដ៏មានព្រះភាគថា (ព្រះដ៏ចម្រើន) មុនពេលព្រះអង្គទ្រង់បរិនិព្វានទៅ បើដល់សង្ក្រាន្ត​ចូលឆ្នាំថ្មីម្ដងៗ តើខ្ញុំព្រះអង្គគួរបំពេញបុញ្ញកម្មអ្វីខ្លះ? 'ព្រះដ៏ចម្រើនត្រាស់ថា' បពិត្រមហារាជ! គួរសាងវាលុកចេតិយនៅឆ្នេរស្ទឹង ឬ ទន្លេហើយនាំយកគ្រឿង​សក្ការៈមានទៀន ធូប គ្រឿងក្រអូប ផ្កាភ្ញីជាដើម មកបូជាថ្វាយចុះ​ ព្រះអង្គក៏បានត្រាស់បញ្ជាក់អំពីអានិ​សង្សនៃការកសាងវាលុកចេតិយ ជាព្រះបាលីគាថាយ៉ាង ដូច្នេះថា៖ 'វាលុកចេតិយំ កត្វា យេ​ នរា អថ នារិយា អន្នំ បានំ វត្ថំ បប្ផំ គន្ធវិលេបនាទីនិ អាហរិត្វា ចេតិយំ បូជំ កត្វា​ សទ្ធាយ ច អានិសំសំ មហប្ផលំ ទ្វេ កុលេ ឧប្បជ្ជតិ ខត្តិយេ ចាបិ ព្រាហ្មណេ ហីនេ កុលេ ន ជាយន្តិ ពាលុកស្ស ឥទំ​ ផលំ ' ប្រែថា៖ នរៈនារីណាដែលបានសាង វាលុកចេតិយ ហើយបានយកនូវបាយ ទឹក សំពត់ ផ្កា គ្រឿងក្រអូប គ្រឿង​លាប ជាដើម បូជាព្រះចេតិយនោះ ដោយសទ្ធាជ្រះថ្លា នរៈនារីនោះ រមែងបានទទួលនូវផលានិសង្សច្រើន រមែង​ទៅកើតក្នុងត្រកូលពីរគឺ ខត្តិយត្រកូល និងព្រាហ្មណត្រកូល មិនទៅកើតក្នុងត្រកូលថោកទាបឡើយ ។",
    "description-img":"../img/sandHouse.jpg"
  },
]

GetKNYDay2()
function GetKNYDay2(){
  var txtKNYDay2 = ""
  KNYDay2.forEach((e)=>{
    txtKNYDay2 += `
      <p>&nbsp;&nbsp;&nbsp;${e["description"]}</p>
      <img src="${e["description-img"]}" alt="">
    `
  })
  document.querySelector(".Paragraph2-1").innerHTML = txtKNYDay2
}