var imge = [
    { "imge": "../img/star1.jpg", "icon": "" },
];
var imgTop = [
    {
        "imges": "../img/star3.jpg", "icon": ""
    },  
]
function getSlide() {
    
    var txt = "";
    imge.forEach((e) => {
        txt += `
        <div class="img-slide">
            <img src="${e["imge"]}" alt="">
        </div>
        `
    });
    document.querySelector(".img-slide").innerHTML = txt;
    document.querySelector(".txt-detales-top").innerHTML = "<p>តាមការសិក្សាស្រាវជ្រាវការរចនានព្វមានសណ្ឋានផ្កាយ តំណាងឲ្យផ្កាយនព្វគ្រោះ និងសេចក្តីសុខចម្រើន របស់មនុស្សសត្វ មានវត្តមានតាំងពីសម័យលង្វែកមកម្លេះ ហើយមុនសម័យលង្វែកការរចនាលើដំបូលប្រាសាទថ្មច្រើនមានសណ្ឋាន នាងច្រាល។ ចង្កៀងគោមខ្មែរមានច្រើនប្រភេទណាស់ ដូចជា ចង្កៀងគោមមូល, ចង្កៀងគោមជ្រុង, ចង្កៀងគោមកន្ទុយត្រី, ចង្កៀងគោមមេអំបៅ, ចង្កៀងគោមនព្វ ឬ ចង្កៀងគោមផ្កាយ នេះឯង ជាដើម។ ខ្មែរតាំងពីដើមមកនិយមចូលចិត្ត ចង្កៀងគោមនព្វ ឬ ចង្កៀងគោមផ្កាយ និង ចង្កៀងគោមកន្ទុយត្រីជាងគេ។</p> <p>យោងការសិក្សាស្រាវជ្រាវការរចនានព្វមានសណ្ឋានផ្កាយ តំណាងឲ្យផ្កាយនព្វគ្រោះ និងសេចក្តីសុខចម្រើន របស់មនុស្សសត្វ មានវត្តមានតាំងពីសម័យលង្វែកមកម្លេះ ហើយមុនសម័យលង្វែកការរចនាលើដំបូលប្រាសាទថ្មច្រើនមានសណ្ឋាន នាងច្រាល។ ចង្កៀងគោមខ្មែរមានច្រើនប្រភេទណាស់ ដូចជា ចង្កៀងគោមមូល, ចង្កៀងគោមជ្រុង, ចង្កៀងគោមកន្ទុយត្រី, ចង្កៀងគោមមេអំបៅ, ចង្កៀងគោមនព្វ ឬ ចង្កៀងគោមផ្កាយ នេះឯង ជាដើម។ ខ្មែរតាំងពីដើមមកនិយមចូលចិត្ត ចង្កៀងគោមនព្វ ឬ ចង្កៀងគោមផ្កាយ និង ចង្កៀងគោមកន្ទុយត្រីជាងគេ។</p>";

    document.querySelector(".contion-txt").innerHTML = "<h4>ប្រវត្តិ​ គោមមផ្កាយ</h4> <p>ជំនឿលើផ្កាយនព្វគ្រោះបានជះឥទ្ធិពលដល់ការសាងសង់លំនៅឋានខ្មែរផងដែរដូចជាការសាងសង់សំណង់លំនៅឋានខ្មែរគេនិយមប្រើគ្រឿងលម្អហៅថានព្វ (នប់)សម្រាប់ដាក់លម្អនៅលើមេដំបូលដែលខ្ពស់ជាងគេ តំណាងឲ្យផ្កាយនព្វគ្រោះ សិរីសួស្តី និងសូមឲ្យការរស់នៅរបស់គាត់បានសេចក្តីសុខចម្រើន។</p>";
}
getSlide();

function gettopimg(){
    var txt2="";
    imgTop.forEach((e2)=>{
        txt2=`
            <div class="imgTop">
                <img src="${e2["imges"]}" alt="">
            </div>
        `
    });
    document.querySelector(".imgtop2").innerHTML =txt2; 
    document.querySelector(".txtTop2").innerHTML =  "<p>តាមការសិក្សាស្រាវជ្រាវការរចនានព្វមានសណ្ឋានផ្កាយ តំណាងឲ្យផ្កាយនព្វគ្រោះ និងសេចក្តីសុខចម្រើន របស់មនុស្សសត្វមានវត្តមានតាំងពីសម័យលង្វែកមកម្លេះហើយមុនសម័យលង្វែកការរចនាលើដំបូលប្រាសាទថ្មច្រើនមានសណ្ឋាន នាងច្រាល។ ចង្កៀងគោមខ្មែរមានច្រើនប្រភេទណាស់ ដូចជា ចង្កៀងគោមមូល, ចង្កៀងគោមជ្រុង, ចង្កៀងគោមកន្ទុយត្រី, ចង្កៀងគោមមេអំបៅ, ចង្កៀងគោមនព្វ ឬ ចង្កៀងគោមផ្កាយ នេះឯង ជាដើម។ ខ្មែរតាំងពីដើមមកនិយមចូលចិត្ត ចង្កៀងគោមនព្វ ឬ ចង្កៀងគោមផ្កាយ និង ចង្កៀងគោមកន្ទុយត្រីជាងគេ។</p>";
};
gettopimg();
