var Paragraph8_1 = [
  "ព្រះបរមរាជវាំងរាជវាំង នៃព្រះរាជាណាចក្រកម្ពុជា នៅរវាងថ្ងៃ១២ ១៣ ១៤ និង ១៥រោច ខែផល្គុន តែងប្រារព្ធព្រះរាជពិធីយ៉ាងមហោឡារិកមួយគឺ ព្រះរាជពិធីត្រស្តិសង្រ្កាន្ត ដែលជាពិធីផ្តាច់ឆ្នាំចាស់ ផ្តាច់សករាជចាស់ ទទួលសករាជថ្មី និងបណ្តេញអស់ឧបទ្រព្យចង្រៃទាំងឡាយទាំងពួងពីឆ្នាំចាស់ ហើយអញ្ជើញទេវតាឆ្នាំថ្មីមកចម្រើនសិរីសួស្តីបវរមហាប្រសើរដល់ព្រះបរមរាជវាំង និងប្រជានុរាស្ដ្រកម្ពុជា។ នេះបើតាមការឱ្យដឹងពី គណៈកម្មការអចិន្ត្រៃយ៍រៀបចំបុណ្យជាតិ អន្តរជាតិ។ ព្រះរាជពិធីត្រស្តិសង្ក្រាន្ត ជាព្រះរាជពិធីសូត្រមន្តបណ្ដេញខ្មោច រំដោះព្រះគ្រោះចម្រើនព្រះសិរីសួសីរបស់ព្រះរាជបល្ល័ង្ក ដូចពិធីសូត្រមន្ត ចម្រើនព្រះបរិត្តធម្មតា របស់ពុទ្ឋបរិស័ទទៅក្នុងពុទ្ធសានមណ្ឌលដែរ គ្រាន់តែព្រះរាជពិធីត្រស្តិសង្ក្រាន្ត មានរបៀបរៀបចំធំដុំជាងពិធីសូត្រមន្តធម្មតាប៉ុណ្ណោះ ព្រោះជាព្រះរាជពិធីរបស់ព្រះមហាក្សត្រ ហើយ ១ឆ្នាំ ត្រូវធ្វើតែម្ដងនៅវេលាដាច់ឆ្នាំ។ ព្រះរាជពិធីនេះ តាមទម្លាប់អ្នកស្រុកគេចូលចិត្តហៅថា ព្រះរាជពិធីសូត្រភាណយក្ស បានជាហៅដូច្នេះព្រោះពិធី នេះត្រូវសូត្រអាដានាដិយបរិត្ត ឬអាដានាដិយសូត្រដែលចែងពីរឿងពួកយក្សចូលទៅគាល់ព្រះសម្មាសម្ពុទ្ធ ជាសូត្រដែលមានក្នុងព្រះសុត្តន្តបិដក ទីយនិកាយ ធដ្ឋភាគ បាដិកវគ្គ ព្រះត្រៃបិដកខ្មែរលេខ ១៩។"
]
var Paragraph8_2 = [
  "នៅក្នុងអាសនៈពិធីមាន តម្កល់គ្រឿងអំបោះក្លុកឬ អំបោះមង្គល ដែលយកអំបោះឆៅជាច្រើនសរសៃមកព័ទ្ធជារង្វង់មូល សម្រាប់ព្រះករុណាទ្រង់ព្រះសិរ និងសម្រាប់ប្រទានដល់អស់ព្រះញាតិវង្សនាម៉ឺនមន្ដ្រីមកពាក់លើសិរសា (ក្បាល) នៅថ្ងៃសូត្រភាណយក្សថ្ងៃចុងក្រោយ ដើម្បីបណ្ដេញឧបទ្រពចង្រៃ។ អំបោះក្លុក ម្យ៉ាងទៀតហៅថា ខ្សែអភិសមរ ជាការវេញខ្សែអំបោះឆៅ ៨សរសៃចូលគ្នា ហើយចៀរយកស្លឹកកំពូលត្នោតប៉ុនម្រាមដៃមកបត់ជា ៤តូចៗចំនួន ៥សន្លឹក ក្នុង ១សន្លឹកៗមានសរសេរពាក្យ “អភិសមរ” សម្រាប់ព្រះមហាក្សត្រទ្រង់ឈៀងព្រះអង្សា និងប្រទានដល់អស់ព្រះញាតិវង្ស នាម៉ឺនមន្ដ្រី ពាក់ឆៀងស្មា បង្ការខ្មោចបិសាច ឧបទ្រពចង្រៃ។"
]
var Paragraph8_3 = [
  "វត្ថុសំខាន់ ១ទៀត ហៅថា “ដំបងពេជ្រ” ដែលយកស្លឹកកំពូលត្នោត ១ទ្រនុង មានសន្លឹក២ មកកួចចុងសន្លឹកមានសណ្ឋានដូចចំពុះក្អែក សន្លឹកម្ខាងសរសេរជា “សព្វេ យក្ខា បិសាចេវ អាឡាវកាទយោមិច ខគ្គំ តាលបត្តំ ទស្វា សព្វេ យក្ខា បលាយន្តិ” ឯសន្លឹកម្ខាងទៀតសរសេរថា “នេកប្បត្តោ នេកប្បត្តា សព្វេយក្ខា បលាយសុ” សម្រាប់ព្រះមហាក្សត្រទ្រង់ និងប្រទានដល់ព្រះបរមវង្សានុវង្ស នាម៉ឺនមន្ដ្រីកាន់ ពេលសូត្រភាណយក្សថ្ងៃចុងក្រោយ ជាវត្ថុសម្រាប់ បណ្តេញយក្ស ខ្មោចព្រាយបិសាច ឧបទ្រពចង្រៃ។ គួរបញ្ជាក់ថា តាមវចនានុក្រមខ្មែរ របស់សម្ដេចព្រះសង្ឃរាជ ជួន ណាត បានចែងថា “ត្រស្តិ” (អានថា “ត្រស់”) មានន័យថា ឈ្មោះព្រះរាជពិធីមួយប្រភេទ ធ្វើក្នុងវេលាយប់ ១៤ រោចខែផល្គុន។ ក្នុងរជ្ជកាលពីបុរាណហៅថា ពិធីបញ្ជាន់ត្រស្តិ សម័យឥឡូវហៅថា ពិធីភាណយក្ខ ឬ ពិធីសូត្រភាណយក្ខ។ ពាក្យថា ត្រស្តិ នេះ ក្លាយមកពីភាសាសំស្ក្រឹតថា ត្រុដ (កិ.) “កាត់ ផ្ដាច់” ចំណែក “ត្រុដិ” (ន.) “ដំណើរកាត់ ការផ្ដាច់”។ ក្នុងព្រះរាជពិធីនេះ សំដៅយកសេចក្តីថា ដំណើរផ្ដាច់ឆ្នាំចាស់ផ្លាស់ចូលឆ្នាំថ្មី៕"
]
GetParagraph8_1()
function GetParagraph8_1(){
  var txtParagraph8_1 = ''
  Paragraph8_1.forEach((e)=>{
    txtParagraph8_1 += `
    <p>${e}</p>
    `
  })
  document.querySelector(".paragraph8_1").innerHTML = txtParagraph8_1
}
GetParagraph8_2()
function GetParagraph8_2(){
  var txtParagraph8_2 = ''
  Paragraph8_2.forEach((e)=>{
    txtParagraph8_2 += `
    <p>${e}</p>
    `
  })
  document.querySelector(".paragraph8_2").innerHTML = txtParagraph8_2
}
GetParagraph8_3()
function GetParagraph8_3(){
  var txtParagraph8_3 = ''
  Paragraph8_3.forEach((e)=>{
    txtParagraph8_3 += `
    <p>${e}</p>
    `
  })
  document.querySelector(".paragraph8_3").innerHTML = txtParagraph8_3
}